{
	"geode": "4.0.1",
	"gd": {
		"mac": "2.2074",
		"android": "2.2074"
	},
	"version": "v1.3.0",
	"early-load": false,
	"tags": [
		"gameplay", "performance", "enhancement"
	],
	"settings": {
		"late-input-cutoff": {
			"name": "Handle Late Inputs",
			"type": "bool",
			"default": false,
			"description": "When this option is disabled, inputs that are determined to have happened <cl>after the current frame</c> are queued to run at <cy>the start of the next frame</c>, regardless of when the input has happened. Enabling this may <cg>improve accuracy</c> in situations where the ticks per frame is inconsistent (such as lag or 144 fps) but at <cr>the cost of consistency</c> (stuck inputs)."
		},
		"input-offset": {
			"name": "Input Offset (ms)",
			"description": "Offsets all inputs by the selected time in milliseconds. This option will not click before frames. The <cl>Handle Late Inputs</c> may be useful for positive offsets.",
			"type": "int",
			"default": 0,
			"min": -1000,
			"max": 1000
		},
		"input-offset-rand": {
			"name": "Input Offset +/-",
			"description": "This is the same as the <cl>Input Offset</c> option, but with a <co>randomized offset</c>. Enjoy!",
			"type": "int",
			"default": 0,
			"min": 0,
			"max": 1000
		},
		"misc-title": {
			"type": "title",
			"name": "Windows Platform Options",
			"platforms": ["win"]
		},
		"loop-style": {
			"name": "Input Loop Type",
			"description": "Determines the style of <cf>input loop</c> in use. This is an <cy>advanced option</c>, please avoid changing it unless you know what you are doing!\n<cc>Auto</c> selects the <cg>best choice</c> of loop from your setup. <co>Wait</c> will hold until a new input is received, which has increased precision and performance over <cf>Poll</c>. Using the wait option will also <cr>globally disable</c> controller support.",
			"type": "string",
			"one-of": ["auto", "poll", "wait"],
			"default": "auto",
			"platforms": ["win"]
		},
		"input-rate": {
			"name": "Alternative Polling Rate",
			"description": "Determines the <cc>amount of times per second</c> that inputs are read, which increases <cg>precision</c> at the cost of some <co>performance</c>. Extremely high values <cr>have little use</c> unless you are using a physics bypass. Has no effect unless the game is in the <cf>polling loop</c>.",
			"type": "int",
			"default": 720,
			"min": 3,
			"max": 2500,
			"control": {
				"slider": false
			},
			"platforms": ["win"]
		},
		"single-threaded": {
			"name": "Run Single Threaded (req. restart)",
			"description": "Runs the game on a single thread, interweaving input and rendering. This has significantly reduced performance, but may be more stable in some cases. It will also force the polling loop at all times. Input polling rate will be limited to the display refresh rate if this option and VSync are enabled. Most similar to the traditional TPS bypass/draw divide.",
			"type": "bool",
			"default": false,
			"platforms": ["win"]
		}
	},
	"id": "zmx.cbf-lite",
	"name": "Click on Steps",
	"developer": "zmx",
	"description": "Click between frames, but without the physics bypass.",
	"repository": "https://github.com/qimiko/click-on-steps"
}
